ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153dxx_cm4.h
/**************  Bit definition for DDRCTRL_PCFGQOS1_1 register  **************/
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos (0U)
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Msk (0x7FFU << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x000007FF */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB     DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Msk             /*!< Specifies the timeout value for transactions mapped to the blue address queue. */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_0   (0x1U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000001 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_1   (0x2U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000002 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_2   (0x4U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000004 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_3   (0x8U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000008 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_4   (0x10U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000010 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_5   (0x20U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000020 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_6   (0x40U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000040 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_7   (0x80U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000080 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_8   (0x100U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x00000100 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_9   (0x200U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x00000200 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_10  (0x400U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x00000400 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos (16U)
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Msk (0x7FFU << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x07FF0000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR     DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Msk             /*!< Specifies the timeout value for transactions mapped to the red address queue. */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_0   (0x1U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00010000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_1   (0x2U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00020000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_2   (0x4U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00040000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_3   (0x8U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00080000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_4   (0x10U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00100000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_5   (0x20U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00200000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_6   (0x40U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00400000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_7   (0x80U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00800000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_8   (0x100U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_9   (0x200U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x02000000 */
#define DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_10  (0x400U << DDRCTRL_PCFGQOS1_1_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x04000000 */

/*************  Bit definition for DDRCTRL_PCFGWQOS0_1 register  **************/
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Pos  (0U)
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Msk  (0xFU << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Pos)  /*!< 0x0000000F */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1      DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Msk            /*!< Separation level indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13 which corresponds to awqos. */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_0    (0x1U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000001 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_1    (0x2U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000002 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_2    (0x4U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000004 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_3    (0x8U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000008 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Pos  (8U)
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Msk  (0xFU << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000F00 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2      DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Msk            /*!< Separation level2 indicating the end of region1 mapping; start of region1 is (level1 + 1). Possible values for level2 are (level1 + 1) to 14 which corresponds to awqos. */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_0    (0x1U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000100 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_1    (0x2U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000200 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_2    (0x4U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000400 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_3    (0x8U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000800 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_Pos (16U)
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_Msk (0x3U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_Pos) /*!< 0x00030000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0     DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_Msk           /*!< This bitfield indicates the traffic class of region 0. */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_0   (0x1U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_Pos) /*!< 0x00010000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_1   (0x2U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION0_Pos) /*!< 0x00020000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_Pos (20U)
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_Msk (0x3U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_Pos) /*!< 0x00300000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1     DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_Msk           /*!< This bitfield indicates the traffic class of region 1. */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_0   (0x1U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_Pos) /*!< 0x00100000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_1   (0x2U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION1_Pos) /*!< 0x00200000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_Pos (24U)
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_Msk (0x3U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_Pos) /*!< 0x03000000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2     DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_Msk           /*!< This bitfield indicates the traffic class of region 2. */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_0   (0x1U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_1   (0x2U << DDRCTRL_PCFGWQOS0_1_WQOS_MAP_REGION2_Pos) /*!< 0x02000000 */

