ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153dxx_cm4.h
/*****************  Bit definition for RCC_RDLSICR register  ******************/
#define RCC_RDLSICR_LSION_Pos                     (0U)
#define RCC_RDLSICR_LSION_Msk                     (0x1U << RCC_RDLSICR_LSION_Pos)                    /*!< 0x00000001 */
#define RCC_RDLSICR_LSION                         RCC_RDLSICR_LSION_Msk                              /*!< LSI oscillator enabled */
#define RCC_RDLSICR_LSIRDY_Pos                    (1U)
#define RCC_RDLSICR_LSIRDY_Msk                    (0x1U << RCC_RDLSICR_LSIRDY_Pos)                   /*!< 0x00000002 */
#define RCC_RDLSICR_LSIRDY                        RCC_RDLSICR_LSIRDY_Msk                             /*!< LSI oscillator ready */
#define RCC_RDLSICR_MRD_Pos                       (16U)
#define RCC_RDLSICR_MRD_Msk                       (0x1FU << RCC_RDLSICR_MRD_Pos)                     /*!< 0x001F0000 */
#define RCC_RDLSICR_MRD                           RCC_RDLSICR_MRD_Msk                                /*!< Minimum Reset Duration */
#define RCC_RDLSICR_MRD_0                         (0x1U << RCC_RDLSICR_MRD_Pos)                  /*!< 0x00010000 */
#define RCC_RDLSICR_MRD_1                         (0x2U << RCC_RDLSICR_MRD_Pos)                  /*!< 0x00020000 */
#define RCC_RDLSICR_MRD_2                         (0x4U << RCC_RDLSICR_MRD_Pos)                  /*!< 0x00040000 */
#define RCC_RDLSICR_MRD_3                         (0x8U << RCC_RDLSICR_MRD_Pos)                  /*!< 0x00080000 */
#define RCC_RDLSICR_MRD_4                         (0x10U << RCC_RDLSICR_MRD_Pos)                 /*!< 0x00100000 */
#define RCC_RDLSICR_EADLY_Pos                     (24U)
#define RCC_RDLSICR_EADLY_Msk                     (0x7U << RCC_RDLSICR_EADLY_Pos)                    /*!< 0x07000000 */
#define RCC_RDLSICR_EADLY                         RCC_RDLSICR_EADLY_Msk                              /*!< External access delays */
#define RCC_RDLSICR_EADLY_0                       (0x1U << RCC_RDLSICR_EADLY_Pos)              /*!< 0x01000000 */
#define RCC_RDLSICR_EADLY_1                       (0x2U << RCC_RDLSICR_EADLY_Pos)              /*!< 0x02000000 */
#define RCC_RDLSICR_EADLY_2                       (0x4U << RCC_RDLSICR_EADLY_Pos)              /*!< 0x04000000 */
#define RCC_RDLSICR_SPARE_Pos                     (27U)
#define RCC_RDLSICR_SPARE_Msk                     (0x1FU << RCC_RDLSICR_SPARE_Pos)                   /*!< 0xF8000000 */
#define RCC_RDLSICR_SPARE                         RCC_RDLSICR_SPARE_Msk                              /*!< Spare bits */
#define RCC_RDLSICR_SPARE_0                       (0x1U << RCC_RDLSICR_SPARE_Pos)              /*!< 0x08000000 */
#define RCC_RDLSICR_SPARE_1                       (0x2U << RCC_RDLSICR_SPARE_Pos)             /*!< 0x10000000 */
#define RCC_RDLSICR_SPARE_2                       (0x4U << RCC_RDLSICR_SPARE_Pos)             /*!< 0x20000000 */
#define RCC_RDLSICR_SPARE_3                       (0x8U << RCC_RDLSICR_SPARE_Pos)             /*!< 0x40000000 */
#define RCC_RDLSICR_SPARE_4                       (0x10U << RCC_RDLSICR_SPARE_Pos)             /*!< 0x80000000 */

/***************  Bit definition for RCC_APB4RSTSETR register  ****************/
#define RCC_APB4RSTSETR_LTDCRST_Pos               (0U)
#define RCC_APB4RSTSETR_LTDCRST_Msk               (0x1U << RCC_APB4RSTSETR_LTDCRST_Pos)              /*!< 0x00000001 */
#define RCC_APB4RSTSETR_LTDCRST                   RCC_APB4RSTSETR_LTDCRST_Msk                        /*!< LTDC block reset */
#define RCC_APB4RSTSETR_DSIRST_Pos                (4U)
#define RCC_APB4RSTSETR_DSIRST_Msk                (0x1U << RCC_APB4RSTSETR_DSIRST_Pos)               /*!< 0x00000010 */
#define RCC_APB4RSTSETR_DSIRST                    RCC_APB4RSTSETR_DSIRST_Msk                         /*!< DSI block reset */
#define RCC_APB4RSTSETR_DDRPERFMRST_Pos           (8U)
#define RCC_APB4RSTSETR_DDRPERFMRST_Msk           (0x1U << RCC_APB4RSTSETR_DDRPERFMRST_Pos)          /*!< 0x00000100 */
#define RCC_APB4RSTSETR_DDRPERFMRST               RCC_APB4RSTSETR_DDRPERFMRST_Msk                    /*!< DDRPERFM block reset */
#define RCC_APB4RSTSETR_USBPHYRST_Pos             (16U)
#define RCC_APB4RSTSETR_USBPHYRST_Msk             (0x1U << RCC_APB4RSTSETR_USBPHYRST_Pos)            /*!< 0x00010000 */
#define RCC_APB4RSTSETR_USBPHYRST                 RCC_APB4RSTSETR_USBPHYRST_Msk                      /*!< USBPHYC block reset */

/***************  Bit definition for RCC_APB4RSTCLRR register  ****************/
#define RCC_APB4RSTCLRR_LTDCRST_Pos               (0U)
#define RCC_APB4RSTCLRR_LTDCRST_Msk               (0x1U << RCC_APB4RSTCLRR_LTDCRST_Pos)              /*!< 0x00000001 */
#define RCC_APB4RSTCLRR_LTDCRST                   RCC_APB4RSTCLRR_LTDCRST_Msk                        /*!< LTDC block reset */
#define RCC_APB4RSTCLRR_DSIRST_Pos                (4U)
#define RCC_APB4RSTCLRR_DSIRST_Msk                (0x1U << RCC_APB4RSTCLRR_DSIRST_Pos)               /*!< 0x00000010 */
#define RCC_APB4RSTCLRR_DSIRST                    RCC_APB4RSTCLRR_DSIRST_Msk                         /*!< DSI block reset */
#define RCC_APB4RSTCLRR_DDRPERFMRST_Pos           (8U)
#define RCC_APB4RSTCLRR_DDRPERFMRST_Msk           (0x1U << RCC_APB4RSTCLRR_DDRPERFMRST_Pos)          /*!< 0x00000100 */
#define RCC_APB4RSTCLRR_DDRPERFMRST               RCC_APB4RSTCLRR_DDRPERFMRST_Msk                    /*!< DDRPERFM block reset */
#define RCC_APB4RSTCLRR_USBPHYRST_Pos             (16U)
#define RCC_APB4RSTCLRR_USBPHYRST_Msk             (0x1U << RCC_APB4RSTCLRR_USBPHYRST_Pos)            /*!< 0x00010000 */
#define RCC_APB4RSTCLRR_USBPHYRST                 RCC_APB4RSTCLRR_USBPHYRST_Msk                      /*!< USBPHYC block reset */

/***************  Bit definition for RCC_APB5RSTSETR register  ****************/
#define RCC_APB5RSTSETR_SPI6RST_Pos               (0U)
#define RCC_APB5RSTSETR_SPI6RST_Msk               (0x1U << RCC_APB5RSTSETR_SPI6RST_Pos)              /*!< 0x00000001 */
#define RCC_APB5RSTSETR_SPI6RST                   RCC_APB5RSTSETR_SPI6RST_Msk                        /*!< SPI6 block reset */
#define RCC_APB5RSTSETR_I2C4RST_Pos               (2U)
#define RCC_APB5RSTSETR_I2C4RST_Msk               (0x1U << RCC_APB5RSTSETR_I2C4RST_Pos)              /*!< 0x00000004 */
#define RCC_APB5RSTSETR_I2C4RST                   RCC_APB5RSTSETR_I2C4RST_Msk                        /*!< I2C4 block reset */
#define RCC_APB5RSTSETR_I2C6RST_Pos               (3U)
#define RCC_APB5RSTSETR_I2C6RST_Msk               (0x1U << RCC_APB5RSTSETR_I2C6RST_Pos)              /*!< 0x00000008 */
#define RCC_APB5RSTSETR_I2C6RST                   RCC_APB5RSTSETR_I2C6RST_Msk                        /*!< I2C6 block reset */
#define RCC_APB5RSTSETR_USART1RST_Pos             (4U)
#define RCC_APB5RSTSETR_USART1RST_Msk             (0x1U << RCC_APB5RSTSETR_USART1RST_Pos)            /*!< 0x00000010 */
#define RCC_APB5RSTSETR_USART1RST                 RCC_APB5RSTSETR_USART1RST_Msk                      /*!< USART1 block reset */
#define RCC_APB5RSTSETR_STGENRST_Pos              (20U)
#define RCC_APB5RSTSETR_STGENRST_Msk              (0x1U << RCC_APB5RSTSETR_STGENRST_Pos)             /*!< 0x00100000 */
#define RCC_APB5RSTSETR_STGENRST                  RCC_APB5RSTSETR_STGENRST_Msk                       /*!< STGEN block reset */

/***************  Bit definition for RCC_APB5RSTCLRR register  ****************/
#define RCC_APB5RSTCLRR_SPI6RST_Pos               (0U)
#define RCC_APB5RSTCLRR_SPI6RST_Msk               (0x1U << RCC_APB5RSTCLRR_SPI6RST_Pos)              /*!< 0x00000001 */
#define RCC_APB5RSTCLRR_SPI6RST                   RCC_APB5RSTCLRR_SPI6RST_Msk                        /*!< SPI6 block reset */
#define RCC_APB5RSTCLRR_I2C4RST_Pos               (2U)
#define RCC_APB5RSTCLRR_I2C4RST_Msk               (0x1U << RCC_APB5RSTCLRR_I2C4RST_Pos)              /*!< 0x00000004 */
#define RCC_APB5RSTCLRR_I2C4RST                   RCC_APB5RSTCLRR_I2C4RST_Msk                        /*!< I2C4 block reset */
#define RCC_APB5RSTCLRR_I2C6RST_Pos               (3U)
#define RCC_APB5RSTCLRR_I2C6RST_Msk               (0x1U << RCC_APB5RSTCLRR_I2C6RST_Pos)              /*!< 0x00000008 */
#define RCC_APB5RSTCLRR_I2C6RST                   RCC_APB5RSTCLRR_I2C6RST_Msk                        /*!< I2C6 block reset */
#define RCC_APB5RSTCLRR_USART1RST_Pos             (4U)
#define RCC_APB5RSTCLRR_USART1RST_Msk             (0x1U << RCC_APB5RSTCLRR_USART1RST_Pos)            /*!< 0x00000010 */
#define RCC_APB5RSTCLRR_USART1RST                 RCC_APB5RSTCLRR_USART1RST_Msk                      /*!< USART1 block reset */
#define RCC_APB5RSTCLRR_STGENRST_Pos              (20U)
#define RCC_APB5RSTCLRR_STGENRST_Msk              (0x1U << RCC_APB5RSTCLRR_STGENRST_Pos)             /*!< 0x00100000 */
#define RCC_APB5RSTCLRR_STGENRST                  RCC_APB5RSTCLRR_STGENRST_Msk                       /*!< STGEN block reset */

